import fractions


# №1. шестнадцатеричное строковое представление

num = int(input('Введите целое число -> '))

#проверка
print(f'проверка = {hex(num)}')

digit = "0123456789abcdef"
hex_str = ""

#перевод числа
while num > 0:
    hex_str = digit[num % 16] + hex_str
    num = num // 16

print(f'шестнадцатеричное {num} -->  {hex_str}')

#-------------------------------------------------------------------------------------------------------
# №2. Напишите программу, которая принимает две строки вида “a/b” - дробь с числителем и знаменателем.
# Программа должна возвращать сумму и произведение* дробей.
# Для проверки своего кода используйте модуль fractions.

#Ввод
fraction_1 = input('Введите первую дробь "-/-" -> ')
fraction_2 = input('Введите вторую дробь "-/-" -> ')

# получаем цифры
a1, b1 = map(int, fraction_1.split('/'))
a2, b2 = map(int, fraction_2.split('/'))

#сумма
s_h = a1*b2+a2*b1
s_z = b1*b2
print(f'Сумма -> {s_h}/{s_z}')
print(f'Произведение -> {a1*a2}/{b2*b1}')
print()

#Проверка
e = fractions.Fraction(a1, b1)
o = fractions.Fraction(a2, b2)
print(f'Проверка суммы - {e+o}')
print(f'Проверка произведения - {e*o}')
